/* 判断两个正整数是否为互质数：最大公约数为 1 的两个非零自然数叫做互质数。

【运行结果】
请输入两个整数：13 5                            请输入两个整数：15 20
13和5是互质数!                                  15和20不是互质数!它们的最大公约数为：5
13和5的最小公倍数是：65                         15和20的最小公倍数是：60

编程要求：
1、请在注释信息Program和End之间完成代码，程序其余位置的代码不要改动！
2、请完成子函数功能。
*/

#include <iostream>
using namespace std;
int gys(int a, int b);
int gbs(int a, int b);

int main()
{
    int x, y;
    cout << "请输入两个整数：";
    cin >> x >> y;
    if (gys(x, y) == 1)             //先删除标志【?】，再填写正确的表达式
        cout << x << "和" << y << "是互质数!" << endl;
    else
        cout << x << "和" << y << "不是互质数!" << endl << "它们的最大公约数为：" << gys(x, y) << endl;
    cout << x << "和" << y << "的最小公倍数为：" << gbs(x, y) << endl;
    return 0;
}


//求两个数的最大公约数
/*********************Program********************/
// 辗转相除法
int gys(int a, int b) {
    while (b > 0) {
        int r = a % b;
        a = b;
        b = r;
    }
    return a;
    //return b == 0 ? a : gys(b, a % b); // 递归法
}
/*********************End********************/


//求两个数的最小公倍数
/*********************Program********************/
// 最小公倍数 = 两个数的乘积 / 最大公约数
int gbs(int a, int b) {
    return a * b / gys(a, b);
}
/*********************End********************/