
/*  从键盘输入图案的行数n，输出如下所示的图案。
【输入】6
【输出】
图案1：                       图案2：
     1                        1*****
    *2*                       12****
   **3**                      123***
  ***4***                     1234**
 ****5****                    12345*
*****6*****                   123456

编程要求：
1、请在注释信息Program和End之间完成代码，程序其余位置的代码不要改动！
2、编程时，只能使用已定义的变量
3、程序只能使用规定的结构，本题要求用for语句实现嵌套循环。
*/
#include<iostream>
using namespace std;
int main()
{
    int i, j, n;
    cout << "请输入图案的行数：";
    cin >> n;
    //图案1的代码
    /*************************Program***************************/
    /* 第一次的代码
    for (i = 1; i <= n; i++) { // 外层循环控制行数
        for (j = i; j < n; j++) // 输出左侧空格
            cout << " ";
        for (j = 1; j < i; j++) // 输出左侧的星号
            cout << "*";
        cout << j; // 输出中间数字
        for (j = 1; j < i; j++) // 输出右侧的星号（空格无需输出）
            cout << "*";
        cout << endl;
    }
    cout << endl; */

    for (i = 1; i <= n; i++) { // 外层循环控制行数
        for (j = 1; j <= n - i; j++) // 输出左侧空格
            cout << " ";
        for (j = 1; j <= 2 * i - 1; j++) // 输出中间数字和星号
            if (j == i)
                cout << i;
            else
                cout << "*";
        cout << endl;
    }
    cout << endl;
    /*************************End***************************/
    //图案2的代码
    /*************************Program***************************/
    /* 第一次的代码
    for (i = 1; i <= n; i++) { // 外层循环控制行数
        for (j = 1; j <= i; j++) // 输出左侧的数字
            cout << j;
        for (j = i; j < n; j++) //输出右侧的星号
            cout << "*";
        cout << endl;
    } */
    for (i = 1; i <= n; i++) { // 外层循环控制行数
        for (j = 1; j <= n; j++) // 输出数字和星号
            if (j <= i)
                cout << j;
            else
                cout << "*";
        cout << endl;
    }
    /*************************End***************************/
    return 0;
}
