/*  从键盘输入m,n，求[m,n]之间的所有完数及它们的和。完数：所有真因子之和等于它本身的数。

编程要求：
1、请在注释信息Program和End之间完成代码，程序其余位置的代码不要改动！
2、编程时，只能使用已定义的变量
3、程序只能使用规定的结构，本题要求循环用for语句实现。

【输出】
请输入两个正整数m和n(m<n): 1 1000
1~1000之间的所有完数为:     6    28   496     //输出数据时设置输出宽度为6，即setw(6)
它们的和为：530
*/
#include <iostream>
#include <iomanip>
using namespace std;
int main()
{
    int m, n, i, j, sum, sum_all = 0;
    cout << "请输入两个正整数m和n(m<n):";
    cin >> m >> n;
    if (m > n)
    {
        /***********************交换m和n************************/
        m = m + n;
        n = m - n;
        m = m - n;
    }
    cout << m << "~" << n << "之间的所有完数为:" << endl;
    /*************************Program***************************/
    for (i = m; i <= n; i++) {
        sum = 0;
        for (j = 1; j <= i / 2; j++) { // 最大的真因子为 i / 2
            if (i % j == 0)
                sum += j; // 累加真因子
        }
        if (sum == i) { // 判断完数
            sum_all += i;
            cout << setw(6) << right << i << " ";
        }
    }
    /*************************End***************************/
    cout << endl << m << "~" << n << "之间的所有完数和为:" << sum_all << endl;
    return 0;
}
