/*  编程实现：从键盘输入n,求阶乘累加和 1!+2!+3!+…+n!
编程要求：
1、请在注释信息Program和End之间完成代码，程序其余位置的代码不要改动！
2、编程时，只能使用已定义的变量
3、程序只能使用规定的结构，本题要求循环用for语句实现。
【输出】
请输入n的值(n的值不超过12):4
1！+2！+3！+4！=33
*/
#include<iostream>
using namespace std;
int main()
{
    int sum = 0, t = 1, i, n;
    cout << "请输入n的值(n的值不超过12):";
    cin >> n;
    /*************************Program***************************/
    for (i = 1; i <= n; i++) {
        t *= i;
        sum += t;
    }
    /*************************End***************************/
    cout << "1!+2!+...+" << n << "!=" << sum << endl;
    return 0;
}