/*字符串加密（请编程实现）对输入的一串信息（不超过50个字符）进行替换加密，加密规则为：将字母表看成首尾衔接的闭合环，
遇大写字母用该字母后面的第3个小写字母替换，遇小写字母用该字母后面的第3个大写字母替换（比如A用d替换、y用B替换）。
同样将数字表看成首尾衔接的闭合环，用该数字前面的第2个数字替换（比如5用3替换、0用8替换）。除字母、数字外的其余字符无需加密。

请输入字符串：Hello C++ 1123!
加密后的结果为：kHOOR f++ 9901!
*/

#include <iostream>
#include <string>
using namespace std;
int main() {
    string str;
    int i, sum = 0;
    cout << "请输入字符串：";
    getline(cin, str);  //利用函数geline输入字符串，接收空格
    for (i = 0;i < str.size();i++) {
        /********************Program**********************/
        if ('A' <= str[i] && str[i] <= 'Z')
            // 大写字母处理，计算 str[i] 到 'A' 的距离，再向后取三个字母。% 26 保证在字母范围内。
            str[i] = 'a' + (str[i] - 'A' + 3) % 26;
        else if ('a' <= str[i] && str[i] <= 'z')
            // 小写字母处理
            str[i] = 'A' + (str[i] - 'a' + 3) % 26;
        else if ('0' <= str[i] && str[i] <= '9')
            // 数字处理，+10 是为了防止下标越界
            str[i] = '0' + (str[i] - '0' - 2 + 10) % 10;
        /********************End**********************/
    }
    cout << "加密后的结果为：" << str << endl;
    return 0;
}
