/*自动生成杨辉三角形，并以各种图案（左下三角、等腰三角、右下三角）输出
请输入方阵的阶数: 5
以左下三角形输出杨辉三角                     以等腰三角形输出杨辉三角                     以右下三角形输出杨辉三角
1                                                       1                                                     1
1   1                                                 1   1                                               1   1
1   2   1                                           1   2   1                                         1   2   1
1   3   3   1                                     1   3   3   1                                   1   3   3   1
1   4   6   4   1                               1   4   6   4   1                              1  4   6   4   1
1   5   10  10  5   1                         1    5   10  10     1                         1  5  10  10  5   1
*/
#include <iostream>
#include <iomanip>
using namespace std;
int main() {
    const int N = 10;
    int a[N][N], n;
    cout << "请输入方阵的阶数:";
    cin >> n;
    //以左下三角形产生杨辉三角所有数据
    /******************Progam******************/
    int i, j;
    // 杨辉三角的外侧为 1
    for (i = 0; i < n; i++) {
        a[i][0] = 1;
        a[i][i] = 1;
    }
    // 计算杨辉三角的内部
    for (i = 2; i < n; i++)
        for (j = 1; j < i; j++)
            a[i][j] = a[i - 1][j - 1] + a[i - 1][j];
    /******************End**********************/

    cout << "以左下三角形输出杨辉三角" << endl;
    /******************Progam******************/
    cout << left;
    for (i = 0; i < n; i++) {
        for (j = 0; j <= i; j++)
            cout << setw(4) << a[i][j];
        cout << endl;
    }
    /******************End**********************/
    cout << "以等腰三角形输出杨辉三角" << endl;
    /******************Progam******************/
    for (i = 0; i < n; i++) {
        for (j = 0; j < n - i - 1; j++)
            cout << "  ";
        for (j = 0; j <= i; j++)
            cout << setw(4) << a[i][j];
        cout << endl;
    }
    /******************End**********************/
    cout << "以右下三角形输出杨辉三角" << endl;
    /******************Progam******************/
    for (i = 0; i < n; i++) {
        for (j = 0; j < n - i - 1; j++)
            cout << "    ";
        for (j = 0; j <= i; j++)
            cout << setw(4) << a[i][j];
        cout << endl;
    }
    /******************End**********************/
    return 0;
}
